package subway.section;

public class SectionAcceptanceTest {
    /**
     * Given 지하철 노선을 생성하고
     * When 하행 종점역을 상행역으로 구간을 등록한다
     * Then 지하철 노선등록에 성공한다
     */
    //TODO: 구간을 등록한다.

    /**
     * Given 지하철 노선을 생성하고
     * When 등록이 된 역을 다시 등록한다
     * Then 지하철 노선등록에 실패한다
     */
    //TODO: 등록이 된 역을 다시 등록하면 실패한다.

    /**
     * Given 지하철 노선을 생성하고
     * When 하행 종점역이 아닌 상행역으로 구간을 등록한다
     * Then 지하철 노선등록에 실패한다
     */

    /**
     * Given 지하철 노선을 생성하고
     * Given 구간을 등록한다
     * When 마지막 구간을 삭제한다
     * Then 구간이 삭제된다.
     */
    //TODO: 구간을 삭제한다.

    /**
     * Given 지하철 노선을 생성하고
     * Given 구간을 등록한다
     * When 등록되지 않은 역을 삭제한다
     * Then 구간 삭제에 실패한다
     */
    //TODO: 하행 종점역이 아닌 구간을 삭제하면 실패한다.


    /**
     * Given 지하철 노선을 생성하고
     * When 구간이 한개인 노선의 구간을 삭제한다
     * Then 구간 삭제에 실패한다.
     */
    //TODO: 구간이 한개일 때 삭제하면 실패한다.

    /**
     * Given 지하철 노선을 생성하고
     * Given 구간을 등록한다
     * When 하행 종점역이 아닌 구간을 삭제한다
     * Then 구간 삭제에 실패한다
     */
    //TODO: 하행 종점역이 아닌 구간을 삭제하면 실패한다.
}
